In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/297.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                         3                      4
0       NaN  NaN  NaN  Hunstein (NP)  1,170,973  Wiggins (NP)  683,483
1       NaN  NaN  NaN                     63.1%                  36.9%
2    County   PR   TP                       NaN                    NaN
3   APPLING   19   19                      1910                   1430
4  ATKINSON    6    6                       737                    494

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4
3   APPLING  19  19  1910  1430
4  ATKINSON   6   6   737   494
5     BACON   7   7  1039   800
6     BAKER   7   7   520   242
7   BALDWIN  16  16  6258  2447

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4
3   APPLING  1910  1430
4  ATKINSON   737   494
5     BACON  1039   800
6     BAKER   520   242
7   BALDWIN  6258  2447

In [9]:
df.columns = ['county', 'Carol W. Hunstein', 'Mike Wiggins']

In [10]:
df.tail(5)

        county Carol W. Hunstein Mike Wiggins
157  WHITFIELD              9315         5199
158     WILCOX              1138          539
159     WILKES              1465          808
160  WILKINSON              1613          701
161      WORTH              2805         1484

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county          candidate votes
0   APPLING  Carol W. Hunstein  1910
1  ATKINSON  Carol W. Hunstein   737
2     BACON  Carol W. Hunstein  1039
3     BAKER  Carol W. Hunstein   520
4   BALDWIN  Carol W. Hunstein  6258

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [16]:
df['office'] = 'Supreme Court Justice'

In [17]:
df['district'] = ''

In [19]:
df['party'] = 'Non-Partisan'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate          party
Carol W. Hunstein  Non-Partisan    1170973
Mike Wiggins       Non-Partisan     683483
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Supreme Court Justice,,Non-Partisan,Carol W. Hunstein,1910
1,ATKINSON,Supreme Court Justice,,Non-Partisan,Carol W. Hunstein,737
2,BACON,Supreme Court Justice,,Non-Partisan,Carol W. Hunstein,1039
3,BAKER,Supreme Court Justice,,Non-Partisan,Carol W. Hunstein,520
4,BALDWIN,Supreme Court Justice,,Non-Partisan,Carol W. Hunstein,6258

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')